In [1]:
# !pip install pymysql

In [2]:
import pymysql

In [5]:
# # connect
# # passwd => str
# db = pymysql.connect(host='localhost', port=3306, user='root', passwd='3927', db='ecommerce', charset='utf8')

# # get cursor
# cursor = db.cursor()

# # SQL query

# sql_create = '''
#     CREATE TABLE product (
#         product_code varchar(20) not null,
#         title varchar(200) not null,
#         ori_price int,
#         discount_price int,
#         discount_percent int,
#         delivery varchar(2),
#         primary key(product_code)
#     );
# '''

# sql_insert = '''
#     INSERT INTO product values('215673140','스위트바니 여름신상',23000,6900,70,'F');
# '''


# # execute query
# cursor.execute(sql_insert) # execute 후 commit 필요

# # commit 
# db.commit()

# # close connection
# db.close()

In [11]:
# 연결 닫으면 다시 연결해야함
db = pymysql.connect(host='localhost', port=3306, user='root', passwd='3927', db='ecommerce', charset='utf8')
# cursor = db.cursor()

# ## SELECT
# sql_select = ''' SELECT * FROM product'''

# cursor.execute(sql_select)

# result = cursor.fetchall()
# ## tuple로 가져옴
# # fetchall => select 된 값 전부 가져오기
# # fetchone => select 된 값 중 첫번째 값만
# # fetchmany => select 된 값들 중 몇개만 (size 지정)

# for record in result:
#     print(record)

# db.close()

In [7]:
# db = pymysql.connect(host='localhost', port=3306, user='root', passwd='3927', db='ecommerce', charset='utf8')
# cursor = db.cursor()

# ## upgrade SELECT

# for i in range(11,20):
#     product_code = 215673140 + i
#     sql_insert_upgrade = """INSERT INTO product VALUES(
#     '""" + str(product_code) + """', '스위트바니 여름신상', 23000, 6900, 70, 'F');"""
#     print(sql_insert_upgrade)
#     cursor.execute(sql_insert_upgrade)
    

# db.commit()

# db.close()

In [9]:
# ## 데이터 수정/삭제

# db = pymysql.connect(host='localhost', port=3306, user='root', passwd='3927', db='ecommerce', charset='utf8')

# # get cursor
# cursor = db.cursor()

# sql_update = """
# UPDATE product SET 
#     title='달리낼리 원피스', 
#     ori_price=9900, 
#     discount_price=5000, 
#     discount_percent=30 
# WHERE product_code ='215673140'  
# """

# sql_delete = """
# DELETE FROM product
# WHERE product_code = '215673149'
# """

# cursor.execute(sql_delete)

# db.commit()

In [12]:
import pymysql

host_name = 'localhost'
host_port = 3306
username = 'root'
password = '3927'
database_name = 'ecommerce'

db = pymysql.connect(host=host_name, port=host_port, user=username, passwd=password, db=database_name, charset='utf8')

In [24]:
## pandas read sql

import pandas as pd

sql_query_show = "show tables"

show = pd.read_sql(sql_query_show,db)
show

  Tables_in_ecommerce
0             product

In [23]:
sql_query_select = 'select * from product'

select = pd.read_sql(sql_query_select,db)
select

,product_code,title,ori_price,discount_price,discount_percent,delivery
0,215673140,달리낼리 원피스,9900,5000,30,F
1,215673151,스위트바니 여름신상,23000,6900,70,F
2,215673152,스위트바니 여름신상,23000,6900,70,F
3,215673153,스위트바니 여름신상,23000,6900,70,F
4,215673154,스위트바니 여름신상,23000,6900,70,F
5,215673155,스위트바니 여름신상,23000,6900,70,F
6,215673156,스위트바니 여름신상,23000,6900,70,F
7,215673157,스위트바니 여름신상,23000,6900,70,F
8,215673158,스위트바니 여름신상,23000,6900,70,F
9,215673159,스위트바니 여름신상,23000,6900,70,F

### 외래키 Foreign Key

In [25]:
import pymysql

host_name = 'localhost'
host_port = 3306
username = 'root'
password = '3927'
database_name = 'sqldb' # sqldb database

db = pymysql.connect(host=host_name, port=host_port, user=username, passwd=password, db=database_name, charset='utf8')

In [28]:
# sql_query_select = 'select * from usertbl'
select_usertbl = pd.read_sql('select * from usertbl',db)
select_usertbl

  userID name  birthYear addr mobile1   mobile2  height       mDate
0    BBK  바비킴       1973   서울     010  00000000     176  2013-05-05
1    EJW  은지원       1972   경북     011  88888888     174  2014-03-03
2    JKW  조관우       1965   경기     016  99999999     172  2010-10-10
3    JYP  조용필       1950   경기     011  44444444     166  2009-04-04
4    KBS  김범수       1979   경남     011  22222222     173  2012-04-04
5    KKH  김경호       1971   전남     019  33333333     177  2007-07-07
6    LJB  임재범       1963   서울     016  66666666     182  2009-09-09
7    LSG  이승기       1987   서울     011  11111111     182  2008-08-08
8    SSK  성시경       1979   서울    None      None     186  2013-12-12
9    YJS  윤종신       1960   경남    None      None     170  2005-05-05

In [32]:
## buytbl의 userID는 usertbl의 userID를 참조하는 외래키이다.
## pk는 num

select_buytbl = pd.read_sql('select * from buytbl',db)
select_buytbl

    num userID prodName groupName  price  amount
0     1    KBS      운동화        의류     30       2
1     2    KBS      노트북        전자   1000       1
2     3    JYP      모니터        전자    200       1
3     4    BBK      모니터        전자    200       5
4     5    KBS      청바지        의류     50       3
5     6    BBK      메모리        전자     80      10
6     7    SSK        책        서적     15       5
7     8    EJW        책        서적     15       2
8     9    EJW      청바지        의류     50       1
9    10    BBK      운동화        의류     30       2
10   11    EJW        책        서적     15       1
11   12    BBK      운동화        의류     30       2
12   14    BBK      운동화        의류     30       2

In [31]:
# buytbl에 데이터를 추가해본다

cursor = db.cursor()

query_insert = """INSERT buytbl (userID,prodName,groupName,price,amount) VALUES('BBK','운동화','의류',30,2);"""
### buytbl의 userID는 usertbl의 userID를 참조하는 외래키이기 때문에 usertbl의 userID에 없는 값을 추가하면 에러가 발생한다.
### => "무결성" 위반
### 제약조건ㅇ

### 반대로, usertbl의 userID중 하나를 삭제했을 경우에

cursor.execute(query_insert)

1

In [ ]:
##